---
kind: method
id: M:Autodesk.Revit.DB.AssemblyInstance.GetMemberIds
source: html/09acaa13-d13a-776b-6019-fd5840dad996.htm
---
# Autodesk.Revit.DB.AssemblyInstance.GetMemberIds Method

Gets member element ids for the assembly instance.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetMemberIds()
```

## Returns
Element ids for the members of the assembly instance.